//---------------------------------------------------------------------------

#include <vcl.h>
#pragma hdrstop

#include "Unit4.h"
#include "Unit1.h"
#include "Unit2.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma resource "*.dfm"
TForm4 *Form4;
//---------------------------------------------------------------------------
__fastcall TForm4::TForm4(TComponent* Owner)
	: TForm(Owner)
{
}
//---------------------------------------------------------------------------
void __fastcall TForm4::Button1Click(TObject *Sender)
{
ShowMessage("Уважаемый господин, Вы приглашены на увлекательное мероприятие по некоторому поводу в пятницу/субботу/воскресенье в одно интересное место. Разрешите откланяться. Ваш NN.");
Form4->Close();
}
//---------------------------------------------------------------------------

